html/org-pages/qc1/week12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-20 Wed 10:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 12 - my notes</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Week 12 - my notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 12 - my notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga138ad7">Week 12 - Quantum Key Distribuition: Part 2</a>
<ul>
<li><a href="#org4b752eb">One-to-one vs many-to-one problems</a></li>
<li><a href="#org8e19b00">Quantum computers usefulness</a></li>
<li><a href="#org16efc4f">Relationships between quantum gates</a></li>
<li><a href="#orga2f020a">LAB</a></li>
<li><a href="#orgd1561a8">Resources</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga138ad7" class="outline-2">
<h2 id="orga138ad7">Week 12 - Quantum Key Distribuition: Part 2</h2>
<div class="outline-text-2" id="text-orga138ad7">
</div>
<div id="outline-container-org4b752eb" class="outline-3">
<h3 id="org4b752eb">One-to-one vs many-to-one problems</h3>
<div class="outline-text-3" id="text-org4b752eb">
<ul class="org-ul">
<li>One-to-one: One output for each input. Ex: Update everyone&rsquo;s schedule for the new year. Each input can be processed individually without affecting the other inputs.</li>
<li>Many-to-one: Many inputs, one output. Ex: Update everyone&rsquo;s schedule based on everyone&rsquo;s availabilites, hence each input needs to be ballanced to get one certain output.</li>
</ul>
</div>
</div>

<div id="outline-container-org8e19b00" class="outline-3">
<h3 id="org8e19b00">Quantum computers usefulness</h3>
<div class="outline-text-3" id="text-org8e19b00">
<ol class="org-ol">
<li>Search and optimization: find the best solution in a large dataset. Ex: Database search, energy distrubuition, climate modeling, portfolio optimization
<ul class="org-ul">
<li>Is this just paralel computing? No. Paralel processing is focused on one-to-one problems, as quantum uses superposition to process multiple inputs (many-to-one) simultaneously.</li>
</ul></li>
<li>Simulation of quantum systems: use the same rules as nature at its most fundamental level to simulate this very own nature. Ex: Protein structure, novel battery materials, solar cells.</li>
</ol>
</div>
</div>

<div id="outline-container-org16efc4f" class="outline-3">
<h3 id="org16efc4f">Relationships between quantum gates</h3>
<div class="outline-text-3" id="text-org16efc4f">
<ul class="org-ul">
<li>Applying H, Z, H in this order is the same as only applying an X gate</li>
<li>Applying H, X, H in this order is the same as only applying a Z gate</li>
<li>This concept can be used as transpilation. Sometimes you work with a computer that can&rsquo;t implement a certain gate, so you can use these workarounds to substitute the desired gate.</li>
</ul>
</div>
</div>

<div id="outline-container-orga2f020a" class="outline-3">
<h3 id="orga2f020a">LAB</h3>
<div class="outline-text-3" id="text-orga2f020a">
</div>
<div id="outline-container-orgd82389e" class="outline-4">
<h4 id="orgd82389e">Statevector vs QASM simulation</h4>
<div class="outline-text-4" id="text-orgd82389e">
</div>
<div id="outline-container-org23adc2c" class="outline-5">
<h5 id="org23adc2c">Statevector steps:</h5>
<div class="outline-text-5" id="text-org23adc2c">
<ol class="org-ol">
<li>Create an &ldquo;empty&rdquo; quantum circuit with no classical bits</li>
</ol>
<p>
<code>qc = QuantumCircuit(1)</code>
</p>
<ol class="org-ol">
<li>Add gates to this circuit</li>
</ol>
<p>
<code>qc.h(0)</code>
</p>
<ol class="org-ol">
<li>Run it on a simulator</li>
</ol>
<p>
<code>svsim = Aer.get_backend('statevector_simulator')</code>
</p>

<p>
<code>job = execute(qc,svsim)</code>
</p>

<p>
<code>result = job.result()</code>
</p>

<p>
<code>counts = result.get_counts(qc)</code>
</p>

<p>
<code>plot_histogram(counts)</code>
</p>
</div>
</div>
<div id="outline-container-org869e259" class="outline-5">
<h5 id="org869e259">QASM steps:</h5>
<div class="outline-text-5" id="text-org869e259">
<ol class="org-ol">
<li>Create an &ldquo;empty&rdquo; quantum circuit with classical bits</li>
</ol>
<p>
<code>qc = QuantumCircuit(1,1)</code>
</p>
<ol class="org-ol">
<li>Add gates to this circuit</li>
</ol>
<p>
<code>qc.h(0)</code>
</p>

<p>
<code>qc.measure(0,0)</code>
</p>
<ol class="org-ol">
<li>Run it on a simulator</li>
</ol>
<p>
<code>backend = Aer.get_backend('qasm_simulator')</code>
</p>

<p>
<code>job = execute(qc,backend,shots=1024)</code>
</p>

<p>
<code>result = job.result()</code>
</p>

<p>
<code>counts = result.get_counts(qc)</code>
</p>

<p>
<code>plot_histogram(counts)</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org56eacf5" class="outline-4">
<h4 id="org56eacf5">Gates revision</h4>
<div class="outline-text-4" id="text-org56eacf5">
<ul class="org-ul">
<li>X gate: 180º rotation around the X axis</li>
<li>H gate: creates a superposition, like a 90º roation around the axis</li>
<li>Z gate: 180º rotation around the Z axis</li>
</ul>
</div>
</div>

<div id="outline-container-orge5248aa" class="outline-4">
<h4 id="orge5248aa">Rotation Gates</h4>
<div class="outline-text-4" id="text-orge5248aa">
<ul class="org-ul">
<li>With the gates we have we are only getting results like \(0\rangle\), \(1\rangle\), \(+\rangle\), and \(-\rangle\)</li>
<li>But we should be able to reach every point in the Block Sphere&#x2026;
<ul class="org-ul">
<li>That&rsquo;s where rotation gates get into place</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org26abf8a" class="outline-5">
<h5 id="org26abf8a">RX gate</h5>
<div class="outline-text-5" id="text-org26abf8a">
<ul class="org-ul">
<li>We tell it how many degrees to rotate around the X axis</li>
<li>Telling it to rotate 180º, it will behave like a regular X gate</li>
<li>The first number is the angle in radians and the second is the qubit index</li>
</ul>
<p>
<code>qc.rx(0.5,0)</code>
</p>
</div>
</div>

<div id="outline-container-org94de55f" class="outline-5">
<h5 id="org94de55f">RZ gate</h5>
<div class="outline-text-5" id="text-org94de55f">
<ul class="org-ul">
<li>We tell it how many degrees to rotate around the Z axis</li>
<li>Telling it to rotate 180º, it will behave like a regular Z gate</li>
<li>The first number is the angle in radians and the second is the qubit index</li>
</ul>
<p>
<code>qc.rz(0.3,0)</code>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd1561a8" class="outline-3">
<h3 id="orgd1561a8">Resources</h3>
<div class="outline-text-3" id="text-orgd1561a8">
<p>
Quantum Computing With Trapped Ions
URL: <a href="https://www.youtube.com/watch?v=9aOLwjUZLm0&amp;list=WL&amp;index=37l">https://www.youtube.com/watch?v=9aOLwjUZLm0&amp;list=WL&amp;index=37l</a>
Description:  Good introduction to trapped ion qubits, and also has a discussion of many-one vs one-one problems
</p>

<p>
The Emerging Quantum Computing Sector
URL: <a href="https://www.youtube.com/watch?v=c0VMhcjZ3lw&amp;list=WL&amp;index=37">https://www.youtube.com/watch?v=c0VMhcjZ3lw&amp;list=WL&amp;index=37</a>
Description: Overview of the emerging QC industry
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-04-20 Wed 10:13</p>
</div>
</body>
</html>
